const { log_ok, log_info, log_error } = require("./consoleColor");

const express = require("express");
const { graphqlHTTP } = require("express-graphql");
const cors = require("cors");
const schema = require("./schema");
const users = [
    /*{id: 1, username: "Ivan", age: 27},
    {id: 2, username: "Maxim", age: 22},
    {id: 3, username: "Anna", age: 20},
    {id: 4, username: "Lena", age: 23},*/
]

const names = [
    "Аарон", "Абрам", "Аваз", "Августин", "Авраам", "Агап", "Агапи", "Агат", "Агафон", "Адам", "Адриан", "Азамат", "Азат", "Азиз", "Аид", "Айдар", "Айрат", "Акакий", "Аким", "Алан", "Александр", "Алексей", "Али", "Алик", "Алим", "Алихан", "Алишер", "Алмаз", "Альберт", "Амир", "Амирам", "Амиран", "Анар", "Анастасий", "Анатолий", "Анвар", "Ангел", "Андрей", "Анзор", "Антон", "Анфим", "Арам", "Аристарх", "Аркадий", "Арман", "Армен", "Арсен", "Арсений", "Арслан", "Артём", "Артемий", "Артур", "Архип", "Аскар", "Аслан", "Асхан", "Асхат", "Ахмет", "Ашот", "Б", "Бахрам", "Бенджамин", "Блез", "Богдан", "Борис", "Борислав", "Бронислав", "Булат", "В", "Вадим", "Валентин", "Валерий", "Вальдемар", "Вардан", "Василий", "Вениамин", "Виктор", "Вильгельм", "Вит", "Виталий", "Влад", "Владимир", "Владислав", "Владлен", "Влас", "Всеволод", "Вячеслав", "Г", "Гавриил", "Гамлет", "Гарри", "Геннадий", "Генри", "Генрих", "Георгий", "Герасим", "Герман", "Германн", "Глеб", "Гордей", "Григорий", "Густав", "Д", "Давид", "Давлат", "Даврон", "Дамир", "Дана", "Даниил", "Данил", "Данис", "Данислав", "Даниэль", "Данияр", "Дарий", "Даурен", "Демид", "Демьян", "Денис", "Джамал", "Джан", "Джеймс", "Джереми", "(Иеремия)", "Джозеф", "Джонатан", "Дик", "Дин", "Динар", "Дино", "Дмитрий", "Добрыня", "Доминик", "Е", "Евгений", "Евдоким", "Евсей", "Евстахий", "Егор", "Елисей", "Емельян", "Еремей", "Ефим", "Ефрем", "Ж", "Ждан", "Жерар", "Жигер", "З", "Закир", "Заур", "Захар", "Зенон", "Зигмунд", "Зиновий", "Зураб", "Зуфар", "И", "Ибрагим", "Иван", "Игнат", "Игнатий", "Игорь", "Иероним", "(Джером)", "Иисус", "Ильгиз", "Ильнур", "Ильшат", "Илья", "Ильяс", "Имран", "Иннокентий", "Ираклий", "Исаак", "Исаакий", "Исидор", "Искандер", "Ислам", "Исмаил", "Итан", "К", "Казбек", "Камиль", "Карен", "Карим", "Карл", "Ким", "Кир", "Кирилл", "Клаус", "Клим", "Конрад", "Константин", "Коре", "Корнелий", "Кристиан", "Кристофер", "Кузьма", "Л", "Лаврентий", "Ладо", "Лев", "Леви", "Ленар", "Леон", "Леонард", "Леонид", "Леопольд", "Лоренс", "Лука", "Лукиллиан", "Лукьян", "Любомир", "Людвиг", "Людовик", "Люций", "М", "Маджид", "Майкл", "Макар", "Макарий", "Максим", "Максимилиан", "Максуд", "Мансур", "Мар", "Марат", "Марк", "Марсель", "Мартин", "(Мартын)", "Матвей", "Махмуд", "Мика", "Микула", "Милослав", "Мирон", "Мирослав", "Михаил", "Моисей", "Мстислав", "Мурат", "Муслим", "Мухаммед", "Мэтью", "Н", "Назар", "Наиль", "Нариман", "Натан", "Нестор", "Ник", "Никита", "Никодим", "Никола", "Николай", "Нильс", "Ной", "Нурлан", "О", "Огюст", "Олег", "Оливер", "Орест", "Орландо", "Осип", "(Иосиф)", "Оскар", "Осман", "Остап", "Остин", "П", "Павел", "Панкрат", "Патрик", "Педро", "Перри", "Пётр", "Платон", "Потап", "Прохор", "Р", "Равиль", "Радий", "Радик", "Радомир", "Радослав", "Разиль", "Раиль", "Раиф", "Райан", "Раймонд", "Рамазан", "Рамзес", "Рамиз", "Рамиль", "Рамон", "Ранель", "Расим", "Расул", "Ратибор", "Ратмир", "Раушан", "Рафаэль", "Рафик", "Рашид", "Ринат", "(Ренат)", "Ричард", "Роберт", "Родим", "Родион", "Рожден", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам", "Рэй", "С", "Савва", "Савелий", "Саид", "Салават", "Самат", "Самвел", "Самир", "Самсон", "Самуил", "Санжар", "Сани", "Саян", "Святослав", "Севастьян", "Семён", "Серафим", "Сергей", "Сидор", "Симба", "Соломон", "Спартак", "Станислав", "Степан", "Сулейман", "Султан", "Сурен", "Т", "Тагир", "Таир", "Тайлер", "Талгат", "Тамаз", "Тамерлан", "Тарас", "Тахир", "Тигран", "Тимофей", "Тимур", "Тихон", "Томас", "Трофим", "У", "Уинслоу", "Умар", "Устин", "Ф", "Фазиль", "Фарид", "Фархад", "Фёдор", "Федот", "Феликс", "Филипп", "Флор", "Фома", "Фред", "Фридрих", "Х", "Хабиб", "Хаким", "Харитон", "Хасан", "Ц", "Цезарь", "Цефас", "Цецилий", "(Сесил)", "Цицерон", "Ч", "Чарльз", "Чеслав", "Чингиз", "Ш", "Шамиль", "Шарль", "Шерлок", "Э", "Эдгар", "Эдуард", "Эльдар", "Эмиль", "Эмин", "Эрик", "Эркюль", "Эрмин", "Эрнест", "Эузебио", "Ю", "Юлиан", "Юлий", "Юнус", "Юрий", "Юстиниан", "Юстус", "Я", "Яков", "Ян", "Яромир", "Ярослав",
    "Ава", "Августа", "Августина", "Авдотья", "Аврора", "Агапия", "Агата", "Агафья", "Аглая", "Агния", "Агунда", "Ада", "Аделаида", "Аделина", "Адель", "Адиля", "Адриана", "Аза", "Азалия", "Азиза", "Аида", "Аиша", "Ай", "Айару", "Айгерим", "Айгуль", "Айлин", "Айнагуль", "Айнур", "Айсель", "Айсун", "Айсылу", "Аксинья", "Алана", "Алевтина", "Александра", "Алексия", "Алёна", "Алеста", "Алина", "Алиса", "Алия", "Алла", "Алсу", "Алтын", "Альба", "Альбина", "Альфия", "Аля", "Амалия", "Амаль", "Амина", "Амира", "Анабель", "Анаит", "Анастасия", "Ангелина", "Анжела", "Анжелика", "Анисья", "Анита", "Анна", "Антонина", "Анфиса", "Аполлинария", "Арабелла", "Ариадна", "Ариана", "Арианда", "Арина", "Ария", "Асель", "Асия", "Астрид", "Ася", "Афина", "Аэлита", "Ая", "Аяна", "Б", "Бажена", "Беатрис", "Бела", "Белинда", "Белла", "(Бэлла)", "Берта", "Богдана", "Божена", "Бьянка", "В", "Валентина", "Валерия", "Ванда", "Ванесса", "Варвара", "Василина", "Василиса", "Венера", "Вера", "Вероника", "Веста", "Вета", "Викторина", "Виктория", "Вилена", "Виола", "Виолетта", "Вита", "Виталина", "(Виталия)", "Влада", "Владана", "Владислава", "Г", "Габриэлла", "Галина", "Галия", "Гаяна", "Гаянэ", "Генриетта", "Глафира", "Гоар", "Грета", "Гульзира", "Гульмира", "Гульназ", "Гульнара", "Гульшат", "Гюзель", "Д", "Далида", "Дамира", "Дана", "Даниэла", "Дания", "Дара", "Дарина", "Дарья", "Даяна", "Джамиля", "Дженна", "Дженнифер", "Джессика", "Джиневра", "Диана", "Дильназ", "Дильнара", "Диля", "Дилярам", "Дина", "Динара", "Долорес", "Доминика", "Домна", "Домника", "Е", "Ева", "Евангелина", "Евгения", "Евдокия", "Екатерина", "Елена", "Елизавета", "Есения", "Ея", "Ж", "Жаклин", "Жанна", "Жансая", "Жасмин", "Жозефина", "Жоржина", "З", "Забава", "Заира", "Залина", "Замира", "Зара", "Зарема", "Зарина", "Земфира", "Зинаида", "Зита", "Злата", "Златослава", "Зоряна", "Зоя", "Зульфия", "Зухра", "И", "Иветта", "(Ивета)", "Изабелла", "Илина", "Иллирика", "Илона", "Ильзира", "Илюза", "Инга", "Индира", "Инесса", "Инна", "Иоанна", "Ира", "Ирада", "Ираида", "Ирина", "Ирма", "Искра", "Ия", "К", "Камила", "Камилла", "Кара", "Каре", "Карима", "Карина", "Каролина", "Кира", "Клавдия", "Клара", "Констанция", "Кора", "Корнелия", "Кристина", "Ксения", "Л", "Лада", "Лана", "Лара", "Лариса", "Лаура", "Лейла", "Леона", "Лера", "Леся", "Лета", "Лиана", "Лидия", "Лиза", "Лика", "Лили", "Лилиана", "Лилит", "Лилия", "Лина", "Линда", "Лиора", "Лира", "Лия", "Лола", "Лолита", "Лора", "Луиза", "Лукерья", "Лукия", "Луна", "Любава", "Любовь", "Людмила", "Люсиль", "Люсьена", "Люция", "Люче", "Ляйсан", "Ляля", "М", "Мавиле", "Мавлюда", "Магда", "Магдалeна", "Мадина", "Мадлен", "Майя", "Макария", "Малика", "Мара", "Маргарита", "Марианна", "Марика", "Марина", "Мария", "Мариям", "Марта", "Марфа", "Мелания", "Мелисса", "Мехри", "Мика", "Мила", "Милада", "Милана", "Милен", "Милена", "Милица", "Милослава", "Мина", "Мира", "Мирослава", "Мирра", "Михримах", "Мишель", "Мия", "Мияна", "Моника", "Муза", "Н", "Надежда", "Наиля", "Наима", "Нана", "Наоми", "Наргиза", "Наталья", "Нелли", "Нея", "Ника", "Николь", "Нина", "Нинель", "Ноа", "Номина", "Нонна", "Нора", "Нурия", "О", "Одетта", "Оксана", "Октябрина", "Олеся", "Оливия", "Ольга", "Офелия", "П", "Павлина", "Памела", "Патриция", "Паула", "Пейтон", "Пелагея", "Перизат", "Платонида", "Полина", "Прасковья", "Р", "Равшана", "Рада", "Разина", "Раиля", "Раиса", "Раифа", "Ралина", "Рамина", "Раяна", "Ребекка", "Регина", "Резеда", "Рена", "Рената", "Риана", "Рианна", "Рикарда", "Римма", "Рина", "Рита", "Роберта", "Рогнеда", "Роза", "Роксана", "Роксолана", "Рузалия", "Рузанна", "Русалина", "Руслана", "Руфина", "Руфь", "С", "Сабина", "Сабрина", "Сажида", "Саида", "Салима", "Саломея", "Сальма", "Самира", "Сандра", "Сания", "Сара", "Сати", "Сауле", "Сафия", "Сафура", "Саяна", "Светлана", "Севара", "Селена", "Сельма", "Серафима", "Сильвия", "Симона", "Снежана", "Соня", "Софья", "Стелла", "Стефания", "Сусанна", "Т", "Таисия", "Тамара", "Тамила", "Тара", "Татьяна", "Тая", "Таяна", "Теона", "Тереза", "Тея", "Тина", "Тиффани", "Томирис", "Тора", "Тэмми", "У", "Ульяна", "Ума", "Урсула", "Устинья", "Ф", "Фазиля", "Фаина", "Фарида", "Фариза", "Фатима", "Федора", "Фёкла", "Фелисити", "Фелиция", "Феруза", "Физалия", "Фируза", "Флора", "Флорентина", "Флоренция", "(Флоренс)", "Флориана", "Фредерика", "Фрида", "Х", "Хадия", "Хилари", "Хлоя", "Хюррем", "Ц", "Цагана", "Цветана", "Цецилия", "(Сесилия)", "Циара", "(Сиара)", "Ч", "Челси", "Чеслава", "Чулпан", "Ш", "Шакира", "Шарлотта", "Шахина", "Шейла", "Шелли", "Шерил", "Э", "Эвелина", "Эвита", "Элеонора", "Элиана", "Элиза", "Элина", "Элла", "Эльвина", "Эльвира", "Эльмира", "Эльнара", "Эля", "Эмили", "Эмилия", "Эмма", "Энже", "Эрика", "Эрмина", "Эсмеральда", "Эсмира", "Эстер", "Этель", "Этери", "Ю", "Юлианна", "Юлия", "Юна", "Юния", "Юнона", "Я", "Ядвига", "Яна", "Янина", "Ярина", "Ярослава", "Ясмина"
]

function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max+1);
    return Math.floor(Math.random() * (max - min) + min); 
}

for (let N = 0; N < 6; N++) {
    users[N] = {
        id: N, username: names[getRandomInt(0, names.length-1)], age: getRandomInt(16, 40)
    } 
}

const app = express();
app.use(cors());




const root = {
    getAllUsers: () => {
        return users;
    },
    getUser: ({ id }) => {
        return users.find(user => user.id == id)
    },
    createUser: ({ input }) => {
        const user = { id: Date.now(), ...input }
        users.push(user)
        return user
    }
}

app.use('/graphql', graphqlHTTP({
    graphiql: true,
    schema,
    rootValue: root
}))



app.listen(5000, err => {
    err ? log_error('SERVER_ERROR: ' + err) : log_ok('Server started...')
});